ubuntu_compile.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>编译和打包</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="编译和打包"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu编译和打包"/>
<meta name="keywords" content="Ubuntu make makefile"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">编译和打包</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 安装通用编译环境</a></li>
<li><a href="#sec-2">2 通用的编译安装步骤</a></li>
<li><a href="#sec-3">3 获得源代码包</a></li>
<li><a href="#sec-4">4 解压缩还原源代码包</a></li>
<li><a href="#sec-5">5 安装编译打包环境</a></li>
<li><a href="#sec-6">6 重新编译并打包Debian化的源码</a></li>
<li><a href="#sec-7">7 获得源码并重新打包</a></li>
<li><a href="#sec-8">8 给源代码打补丁</a></li>
<li><a href="#sec-9">9 安装 gtk+ 编译环境</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 安装通用编译环境</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">sudo apt-get install build-essential
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 通用的编译安装步骤</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">./configure &amp;&amp; make &amp;&amp; sudo make install
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 获得源代码包</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">sudo apt-get source mysql-server
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 解压缩还原源代码包</h2>
<div class="outline-text-2" id="text-4">




<pre class="example">dpkg-source -x mysql-dfsg-5.1_5.1.30-1.dsc
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 安装编译打包环境</h2>
<div class="outline-text-2" id="text-5">




<pre class="example">sudo apt-get build-dep mysql-server
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 重新编译并打包Debian化的源码</h2>
<div class="outline-text-2" id="text-6">




<pre class="example">dpkg-buildpackage -rfakeroot
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 获得源码并重新打包</h2>
<div class="outline-text-2" id="text-7">





<pre class="example">apt-get source php5-cgi  
#或手工下载源码后使用 dpkg-source -x  php5_5.2.6.dfsg.1-3ubuntu4.1.dsc 解开源码
sudo apt-get build-dep php5-cgi
cd php5-5.2.6.dfsg.1
dpkg-buildpackage -rfakeroot -uc -b
</pre>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 给源代码打补丁</h2>
<div class="outline-text-2" id="text-8">




<pre class="example">patch -p0 &lt; mysql.patch
</pre>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 安装 gtk+ 编译环境</h2>
<div class="outline-text-2" id="text-9">




<pre class="example">sudo apt-get install build-essential libgtk2.0-dev
</pre>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
